[Killed] BlockStatement
src/index.ts:1:50
-export const log = (...args: unknown[]): void => {
-  console.log("LOGGER: ", ...args);
-};
+export const log = (...args: unknown[]): void => {};
 
killedBy: All tests
statusReason: > @repo/logger@0.0.0 test
> wp test --file vitest.config.ts


test failed (exit 1)
<summary>: ❯ src/tests/log.test.ts (1 test | 1 failed) 4ms
<summary>: FAIL  src/tests/log.test.ts > @repo/logger > prints a message
<summary>: AssertionError: expected "noop" to be called with arguments: [ 'LOGGER: ', 'hello' ]

[Killed] StringLiteral
src/index.ts:2:15
 export const log = (...args: unknown[]): void => {
-  console.log("LOGGER: ", ...args);
+  console.log("", ...args);
 };
 
killedBy: All tests
statusReason: > @repo/logger@0.0.0 test
> wp test --file vitest.config.ts


test failed (exit 1)
<summary>: ❯ src/tests/log.test.ts (1 test | 1 failed) 5ms
<summary>: FAIL  src/tests/log.test.ts > @repo/logger > prints a message
<summary>: AssertionError: expected "noop" to be called with arguments: [ 'LOGGER: ', 'hello' ]
